[
    {
        "publication" : "2021-02-19",
        "link" : "joblistlink1",
        "reference" : "mech-design (auto)",
        "content" : [
            {
                "type" : "title",
                "data" : "Qualifications"
            },{
                "type" : "list",
                "data" : [
                    "Ability to use AUTOCAD 2D and SOLIDWORKS 3D (mechanical CAD) effectively in the design work",
                    "Ability to perform Pressure Vessel Calculation as per ASME using COMPRESS",
                    "Ability to create accurate manufacturing Bill of Material.",
                    "Knowledge of applicable safety and ergonomics standards",
                    "A post-secondary diploma or degree in mechanical design, mechanical engineering or equivalent and minimum 2 - 3 years’ experience in a similar position."
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "title",
                "data" : "Job Duties (Schedule: 8 hour shift)"
            },{
                "type" : "list",
                "data" : [
                    "Design pressure vessels and generate pressure vessel calculation as per client requirement",
                    "Understanding of welding procedure and symbols",
                    "Generate accurate drawings and manufacturing BOM to facilitate correct selection of material for purchasing, cutting, rolling, machining and welding",
                    "Work cooperatively with clients, fellow employees, contractors, and management and suppliers.",
                    "Communicate with vendors for technical information and specifications",
                    "Communicate with technical managers and project team members regarding all aspects of the project",
                    "Assist the builders of the equipment  and QC in the resolution of problems to complete the project"
                ]
            },{
                "type" : "text",
                "data" : "We appreciate your interest and thank you for applying by emailed resume,"
            },{
                "type" : "text",
                "data" : "Only those selected for interviews will be contacted."
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "space",
                "data" : ""
            }
        ]
    },{
        "publication" : "2021-02-19",
        "link" : "joblistlink2",
        "reference" : "proj-eng",
        "content" : [
            {
                "type" : "title",
                "data" : "Qualifications"
            },{
                "type" : "list",
                "data" : [
                    "Knowledge and Experience in Pressure Vessel and Pressure Piping designing as per ASME Code",
                    "Ability to use AUTOCAD 2D and SOLIDWORKS 3D (mechanical CAD) effectively in the design work",
                    "Ability to perform Pressure Vessel Calculation as per ASME using COMPRESS",
                    "Ability to create accurate manufacturing Bill of Material and perform inspection as per ITPs",
                    "Knowledge of Drawing Layouts and Detail Dimensioning",
                    "Strong Verbal, Interpersonal and Written communication skills",
                    "Strong Problem-solving abilities and Critical Thinking Skills",
                    "Knowledge of applicable Health, Safety and ergonomics standards",
                    "A post-secondary diploma or degree in mechanical design, mechanical / chemical engineering or equivalent and minimum 2 - 3 years’ experience in a similar position."
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "title",
                "data" : "Job Responsibilities"
            },{
                "type" : "list",
                "data" : [
                    "Design pressure vessels and generate pressure vessel calculation as per code and client requirement",
                    "Understanding of welding procedure and symbols and developing new welding procedures in consultation with QC",
                    "Sizing and selection of Materials and Components including generation of accurate drawings and manufacturing BOM to facilitate correct selection of material for purchasing, cutting, rolling, machining and welding",
                    "Interact with client for project progress from conceptualization to shipping",
                    "Interaction with vendors to obtain component quotations, specifications and generating project POs",
                    "Creation of Purchase Requisitions for Specialized Design Elements",
                    "Communicate with technical managers and project team members regarding all aspects of the project",
                    "Assist the builders of the equipment  and QC in the resolution of problems to complete the project",
                    "Interaction with shop personnel during overall life cycle of project ",
                    "Work cooperatively with clients, fellow employees, contractors, and management and suppliers."
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "text",
                "data" : "We appreciate your interest and thank you for applying by emailed resume,"
            },{
                "type" : "text",
                "data" :"Only those selected for interviews will be contacted."
            },{
                "type" : "space",
                "data" : ""
            }
        ]
    },{
        "publication" : "2021-02-19",
        "link" : "joblistlink3",
        "reference" : "qcman",
        "content" : [
            {
                "type" : "title",
                "data" : "Qualifications"
            },{
                "type" : "list",
                "data" : [
                    "Knowledge and Experience in Pressure Vessel and Pressure Piping designing as per ASME Code",
                    "Ability to understand Pressure Vessel Calculation as per ASME using COMPRESS",
                    "Ability to understand manufacturing Bill of Material and perform inspection as per ITPs",
                    "Knowledge of Drawing Layouts and Detail Dimensioning",
                    "Strong Verbal, Interpersonal and Written communication skills",
                    "Strong Problem-solving abilities and Critical Thinking Skills",
                    "Knowledge of applicable Health, Safety and ergonomics standards",
                    "A post-secondary diploma or degree in mechanical design, mechanical / chemical engineering or equivalent and minimum 2 - 3 years’ experience in a similar position."
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "title",
                "data" : "Job Duties (Schedule: 8 hour shift)"
            },{
                "type" : "list",
                "data" : [
                    "Verify pressure vessel deisgn and pressure vessel calculation as per code and client requirement",
                    "Verify welding procedure and symbols and coordinate in developing new welding procedures in consultation with Project Engineer",
                    "Understanding of Materials and Components including drawings, manufacturing BOM  and manufacturing process that includes but not limited to cutting, rolling, machining, welding, surface treatment, NDE, Hydrotesting, and other related methods",
                    "Interaction with vendors and project engineers to verify component and manufacturing parts as per project POs",
                    "Communicate with technical managers and project team members regarding quality aspects of the project",
                    "Assist the builders of the equipment in the resolution of problems to complete the project",
                    "Interaction with shop personnel during overall life cycle of project ",
                    "Keep all hard copy and electronic forms up to date and dated accurately for document creation and control",
                    "Regular inspection and Audits on shop floor to raise awareness of Quality that includes but not limited to incoming parts, modified parts, in-process testing or final product testing, inspections, warehouse control and traceability.",
                    "Lab testing, In-process testing and final testing as per approved ITPs, drawing and calculations",
                    "Training of all applicable personnel and departments on the Quality Manual and Quality Instructions.",
                    "Responsible for the control and maintenance of all inspection, measuring and test equipment.",
                    "Maintain calibration of all test equipment on an ongoing basis.",
                    "Internal NCR, Creation of Internal Non Conformance Reports, Data Analysis, and report findings and make recommendations for Continuous Improvement of Processes ",
                    "Prepare and participate in annual audit, triannual audit or inspections from certificating agencies for job.",
                    "Work cooperatively with clients, fellow employees, contractors, and management and suppliers."
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "text",
                "data" : "We appreciate your interest and thank you for applying by emailed resume,"
            },{
                "type" : "text",
                "data" : "Only those selected for interviews will be contacted."
            },{
                "type" : "space",
                "data" : ""
            }
        ]
    },{
        "publication" : "2021-01-29",
        "link" : "joblistlink4",
        "reference" : "adm-astn",
        "content" : [
            {
                "type" : "title",
                "data" : "Qualifications"
            },{
                "type" : "list",
                "data" : [
                    "Good interpersonal, communication and written skill in English",
                    "Minimum 2 years’ experience in similar role"
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "title",
                "data" : "Job Duties (Schedule: 8 hour shift)"
            },{
                "type" : "list",
                "data" : [
                    "Type and proofread correspondence, forms and other documents",
                    "Sort, process and verify applications, receipts and other documents",
                    "Send and receive messages",
                    "Provide general information to clients and the public",
                    "Perform basic bookkeeping tasks",
                    "Organize and schedule office work",
                    "Locate and remove files requested",
                    "Label, file and retrieve documents",
                    "Receive and forward telephone or electronic enquiries",
                    "Maintain and prepare reports from manual or electronic files, inventories, mailing lists and databases",
                    "Prepare invoices and bank deposits",
                    "File material in storage area",
                    "Order office supplies and maintain inventory"
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "text",
                "data" : "We appreciate your interest and thank you for applying by emailed resume,"
            },{
                "type" : "text",
                "data" : "Only those selected for interviews will be contacted."
            },{
                "type" : "space",
                "data" : ""
            }
        ]
    },{
        "publication" : "2021-01-30",
        "link" : "joblistlink5",
        "reference" : "weld-fit",
        "content" : [
            {
                "type" : "title",
                "data" : "Qualifications"
            },{
                "type" : "list",
                "data" : [
                    "Minimum 3 years’ experience as stainless steel tube fitter in a pharma or food and beverage industry. Journeyman License (Preferred)",
                    "Welding Techniques: Gas tungsten arc welding (GTAW) (TIG) using all welding positions",
                    "Polishing Knowledge with Hand Grinding, Belt Sanding",
                    "Ability to read and interpret P&ID, equipment and fabrication drawings",
                    "Safety oriented, observing proper lifting techniques and safe use of all equipment",
                    "High attention to detail in all areas of work and quality focused approach to work",
                    "Superior hand/eye coordination, manual dexterity and ability to handle heavy loads as this position is physically demanding",
                    "Ability to understand manufacturing Bill of Material and perform inspection as per ITPs",
                    "Knowledge of Drawing Layouts and Detail Dimensioning",
                    "Knowledge of applicable Health, Safety and ergonomics standards",
                    "Ability to work independently and with a comprehensive team"
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "title",
                "data" : "Job Duties (Schedule: 8 hour shift)"
            },{
                "type" : "list",
                "data" : [
                    "Experience and knowledge in process piping systems, fabrication and equipment for the pharmaceutical, food and beverage industry",
                    "Read and interpret welding blueprints, drawings, specifications, manuals and procedures",
                    "Fit up and welding of sanitary process lines and Schedule pipe of varying thicknesses (.035” - .375”)",
                    "Fit- up and welding of stainless steel structural members and of varying sizes and thicknesses to fabricate frames and platforms for pharmaceutical and hygienic process equipment",
                    "Manual and automatic TIG welding. MIG welding (added advantage)",
                    "Polishing of equipment with Hand Grinding, Belt Sanding.",
                    "Examine welds and ensure that they meet the companies standards and/or specifications",
                    "Identify potential issues and risks and proactively manage and resolve issues with minimal impact on timing and budget",
                    "Regularly report on current project status to direct superior",
                    "Communicate with Quality Control team members ensuring highest level of standards are met",
                    "Operate hoists and lifting equipment, manufacturing of tanks, skidded systems",
                    "Responsible for fabrication and installation of sanitary process piping and equipment"
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "text",
                "data" : "We appreciate your interest and thank you for applying by emailed resume,"
            },{
                "type" : "text",
                "data" : "Only those selected for interviews will be contacted."
            },{
                "type" : "space",
                "data" : ""
            }
        ]
    },{
        "publication" : "2021-01-31",
        "link" : "joblistlink6",
        "reference" : "PGF00666 / SI",
        "content" : [
            {
                "type" : "title",
                "data" : "Qualifications"
            },{
                "type" : "list",
                "data" : [
                    "High School Diploma or Equivalent is required",
                    "1-3 years of experience in a manufacturing facility",
                    "Understanding of WHMIS labelling and ability to identify potential work hazards",
                    "Ability to read, write, understand and speak fluent English",
                    "Ability to work in a fast-paced and demanding environment",
                    "Mechanically inclined",
                    "Flexibility, ability and willingness to switch shifts to cover vacation, sickness, overtime, etc. based on business needs",
                    "Ability to lift up to 40 lbs. several times each day.",
                    "Ability to stand for periods of up to 4 hours at a time",
                    "Ability to work both independently and collaboratively in a team environment",
                    "Good work ethic, solid attendance records, positive attitude"
                ]
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "title",
                "data" : "Job Duties (Schedule: 8 hour shift)"
            },{
                "type" : "text",
                "data" : "There is no necessarily an exhaustive list of all responsibilities, duties, skills, efforts, requirements, or working conditions associated with this job and management decides the job duties as per requirement. Management reserves the right to revise the job duties or to require that other or different tasks be performed as assigned."
            },{
                "type" : "space",
                "data" : ""
            },{
                "type" : "text",
                "data" : "We appreciate your interest and thank you for applying by emailed resume,"
            },{
                "type" : "text",
                "data" : "Only those selected for interviews will be contacted."
            },{
                "type" : "space",
                "data" : ""
            }
        ]
    }
]